/* 計算機概論實務-基本練習作業-作業25*/
/* 製作人：郭柏鋒 */
/* 完成時間：2019/05/17 08:57*/ 
#include <stdio.h>  //函示庫 
#include <stdlib.h> //函示庫 
int main(void)
{
	printf("計算機概論實務-基礎練習作業-作業25\n");
	printf("製作人：郭柏鋒\n");
	printf("完成時間：2019/05/17 08:57\n");
	printf("-------------------------------------------------\n");
	printf("                  輸出整個陣列的值               \n");
	printf("-------------------------------------------------\n");
	printf("結果：\n");
    int *p[4]; //定義指標陣列 
    int array[4][3]={{1,2,3},{4,5,6},{7,8,9},{10,11,12}};//定義一個二維陣列 
    int i; 
    p[0]=array[0];//將二維陣列寫入指標陣列 
    p[1]=array[1];//將二維陣列寫入指標陣列 
    p[2]=array[2];//將二維陣列寫入指標陣列 
    p[3]=array[3];//將二維陣列寫入指標陣列 

    for (i=0; i<3; i++) //顯示出來 
       printf("%d   ", *(p[0]+i));
       printf("\n");
	   
    for (i=0; i<3; i++) //顯示出來 
       printf("%d   ", *(p[1]+i));
       printf("\n");
       
    for (i=0; i<3; i++) //顯示出來  
       printf("%d   ", *(p[2]+i));
       printf("\n");   
    
	for (i=0; i<3; i++) //顯示出來  
       printf("%d   ", *(p[3]+i));
       printf("\n");
    
    system("pause");//暫停視窗 
    return 0;//回傳值 0 
}

